import UIKit
import Foundation

/*

 Домашнє завдання 2. Частина 2.

 Загальні відомості:
    cityNames - константа, яка містить усі необхідні назви міст
                для відображення даних про погоду для кожного міста (оголошена нижче у коді)

    weatherInCities - масив з повною інформацією про погоду для кожного міста,
                      використовується для виводу даних на екран (заповнюеться нижче у коді)

 ЕКРАН 1:
    Вимоги:
        - ЕКРАН 1 має виводити повну інформацію про погоду для кожного міста в одному екземплярі
        у форматі:
             Назва міста:
             t: значення темпераутри у Цельсій
             t: значення температурі у Фаренгейт
             min t: значення мінімальної темпераутри у Цельсій / значення мінімальної темпераутри у Фаренгейт
             max t: значення максимальної темпераутри у Цельсій / значення максимальної темпераутри у Фаренгейт

        наприклад:
             Kyiv:
             t: 25.0 C
             t: 65.00 F
             min t: 22.0 C / 58.00 F
             max t: 27.0 C / 68.00 F


    Поточний результат:
        - ЕКРАН 1 виводить інформацю тільки для міста Київ
        - ЕКРАН 1 виводить дублювання інформації для міста Київ
        - ЕКРАН 1 виводить інформацю про погоду тільки у значенні Кельвін,
          а має виводити у Цельсій та Фаренгейт


 ЕКРАН 2:
    Вимоги:
        - ЕКРАН 2 має виводити інформацію про погоду тільки у Цельсій для кожного міста в одному екземплярі
        у форматі:
            Назва міста:
            t: значення темпераутри у Цельсій

        наприклад:
            Kyiv:
            t: 25.0 C


    Поточний результат:
     - ЕКРАН 2 виводить інформацю тільки для міста Львів
     - ЕКРАН 2 виводить дублювання інформації для міста Львів у кількості білше, ніж кількість заданих міст разом
     - ЕКРАН 2 виводить інформацю про погоду тільки у значенні Кельвін,
       а має виводити у Цельсій


 ЕКРАН 3:
    Вимоги:
        - ЕКРАН 3 має виводити інформацію про погоду тільки у Фаренгейт для кожного міста в одному екземплярі
        у форматі:
            Назва міста:
            t: значення темпераутри у Фаренгейт

        наприклад:
            Kyiv:
            t: 55.0 F


    Поточний результат:
     - ЕКРАН 3 виводить інформацю тільки для одного міста
       і це місто змінюється випадковим чином після кожного запуску програми
     - ЕКРАН 3 виводить дублювання інформації одного випадеового міста у кількості 4 рази
     - ЕКРАН 3 виводить інформацю про погоду тільки у значенні Кельвін,
       а має виводити у Фаренгейт


 Корисна інформація:
 *
   формула конвертації з Кельвіна у Цельсій:
   Тц = Тк - 273.15,
   де Тц - температура у Цельсій
      Тк - температура у Кельвін

 *
   формула конвертації з Кельвіна у Фаренгейт:
   Тф = (Тк * (9.0/5.0) - 459.67),
   де Тф - температура у Фаренгейт
      Тк - температура у Кельвін

 *
   arc4random() % n - генерація випадкового числа у діапазоні від нуля до n,
   де n - крайнє/максимальне значення діапазону

 *
   String(format: "%.nf", DoubleValue) - обмеження виводу чисел після крапки,
   де n - кількість числел для виводу після крапки
   наприклад:
        let somValue: Double = 23.34563725647
        let stringToPrint = String(format: "%.3f", somValue) // 23.345
        23.345 - буде виведено значення: 23 і 3 числа після крапки

 *
    '_' - назва пам'яті, яка не використовується далі у коді (можна назвати заглушка)
    наприклад:
        var _ = index
        або
        let _ = index - значення індексу записується у константу, яка не використвується,
                        може застосовуватися для уникання підсвітки Warnings (попередження,
                        наприклад, оголосили змінну, але не використали далі в коді,
                        Xcode пдсвітить цю строку жовтим кольором)

 */

// резервуємо свій тип для зберігання данних про погоду
// (назва міста, температура, мінімальна температура, максимальна температура)
typealias Weather = (String, Double, Double, Double)

// константа 0 по Кельвіну без урахування знаку
let kelvinZero = 273.15

// масив імен міст
let cityNames = ["Харків", "Київ", "Одеса", "Львів", "Чернігів", "Житомир", "Вінниця"]

// створюємо змінну - пустий масив для зберігання опису погоду для кожного міста
var weatherInCities: [Weather] = []

// запускаємо цикл для заповнення пустого масиву weatherInCities
// інформацією про погоду для кожної назви міста, вказаних у масиві cityNames
for index in 0 ..< cityNames.count { // виправляю діапазон, щоб масив weatherInCities
                                     // заповнився усіма даними з масиву cityNames
    let weatherInfo = Weather(
        city: cityNames[index], // записуємо назву міста
        temp: Double(arc4random() % 30) + kelvinZero, // генеруємо випадкове значення температури у Кельвінах
        tempMin: Double(arc4random() % 30) + kelvinZero, // генеруємо випадкове значення температури у Кельвінах
        tempMax: Double(arc4random() % 30) + kelvinZero // генеруємо випадкове значення температури у Кельвінах
    )
    weatherInCities.append(weatherInfo) // додаємо згенеровані погодні значення для поточної назви міста
}

weatherInCities // перевіряю як згенерувалися данні

// Приклад використання генерації числа
let cityIndex = Int(arc4random() % UInt32(weatherInCities.count - 1))



// виводимо ПОВНУ інформацію для кожного міста, що є у масиві weatherInCities
print("---------- ЕКРАН 1 ----------")
for index in 0 ..< weatherInCities.count { // виправляю діапазон, щоб цикл опрацював дані для кожного міста у масиві
    //let _ = index // коментую, це нам не потрібно, index використовується у коді, Warnings не буде.
    let weatherInfo = weatherInCities[index] // додаю index замість 0, щоб були опрацьовані усі міста у масиві
    let city = weatherInfo.0 // зберігаємо назву міста
    
    let kelvin = weatherInfo.1 // залишаю константу зі значенням по Кельвіну,
                               // на випадок, якщо треба буде з нею працювати в майбутньому.
    
    let celsius = kelvin - 273.15 // конвертую з Кельвіна у Цельсій
    let fahrenheit = (kelvin * (9.0/5.0) - 459.67) // конвертую з Кельвіна у Фаренгейт
    
    let kelvinMin = weatherInfo.2 // зберігаємо мінімальнне значення температури у Кельвінах
    let celsiusMin = kelvinMin - 273.15
    let fahrenheitMin = (kelvinMin * (9.0/5.0) - 459.67)
    
    let kelvinMax = weatherInfo.3 // зберігаємо максимальне значення температури у Кельвінах
    let celsiusMax = kelvinMax - 273.15
    let fahrenheitMax = (kelvinMax * (9.0/5.0) - 459.67)

    print("\n\(city):")
    print("t: \(String(format: "%.1f", celsius)) C") // обмежую вивід чисел після крапки
    print("t: \(String(format: "%.2f", fahrenheit)) F")
    print("min t: \(String(format: "%.1f", celsiusMin)) C / \(String(format: "%.2f", fahrenheitMin)) F")
    print("max t: \(String(format: "%.1f", celsiusMax)) C / \(String(format: "%.2f", fahrenheitMax)) F")
}
print("\n-----------------------------")
print("\n\n")



// виводимо інформацію про температуру тільки у Цельсій
// для кожного міста, що є у масиві weatherInCities
print("---------- ЕКРАН 2 ----------")
for index in 0 ..< weatherInCities.count { // виправляю діапазон, щоб цикл опрацював дані для кожного міста у масиві
    //let _ = index // коментую, це нам не потрібно, index використовується у коді, Warnings не буде.
    let weatherInfo = weatherInCities[index] // додаю index замість 2, щоб були опрацьовані усі міста у масиві
    let city = weatherInfo.0 // зберігаємо назву міста
    let kelvin = weatherInfo.1 // зберігаємо значення температури у Кельвінах
    let celsius = kelvin - 273.15 // конвертую з Кельвіна у Цельсій
    print("\n\(city):\nt: \(String(format: "%.1f", celsius)) C")
}
print("\n-----------------------------")
print("\n\n")



// виводимо інформацію про температуру тільки у Фаренгейт
// для кожного міста, що є у масиві weatherInCities
print("---------- ЕКРАН 3 ----------")
for index in 0 ..< weatherInCities.count { // виправляю діапазон, додаючи знак <,
                                           // бо цикл буде намагатися опрацювати більше значень ніж є у масиві.
    //let _ = index // коментую, це нам не потрібно, index використовується у коді, Warnings не буде.
    let weatherInfo = weatherInCities[index] // замінюю cityIndex на index для опрацьовання усіх міст у масиві,
                                             // а не тільки одного, рандомно обраного
    let city = weatherInfo.0 // зберігаємо назву міста
    let kelvin = weatherInfo.1 // зберігаємо значення температури у Кельвінах
    let fahrenheit = (kelvin * (9.0/5.0) - 459.67) // конвертую з Кельвіна у Фаренгейт
    print("\n\(city):\nt: \(String(format: "%.2f", fahrenheit)) F")
        /*
         в завданні був приклад значенння на Екрані 3 з округленням до десятих,
         "наприклад:
                     Kyiv:
                     t: 55.0 F"
         але на першому екрані з округленням до сотих
         і тут вказано %.2f,
         тож залишаю для Фаренгейтів округлення до сотих.
        */
}
print("\n-----------------------------")
